#include <stdio.h>
#include <stdlib.h>
typedef struct node{ //  نوع بيانات جديد سميته نود يحتوي علي عنصرين داتا وبوينتر
    int number; // int داتا من نوع
    struct node* next; //  بوينتر من نوع ستراكت نود نوع الملفات الي انا عامله

}node;
int main(){

    node* list = NULL; // نوع البيانات الجديد الي عملناه node عملت بوينتر من نوع

    node* n = malloc(sizeof(node)); // علشان يكون عنصر مساعد احط بيه الداتاg نوع البيانات الجديد الي عملناه node عملت بوينتر من نوع
    if(n == NULL){
        return 1; // شرط
    }

    n->number = 1;  // ضيفت الداتا
    n->next = NULL; // خليت النيكست بيساوي نال
    list = n; //n وبعدين خليت الليست بتشاور علي ال
    // حلاص n وبكدة انا مبقتش محتاج ال


    n = malloc(sizeof(node)); // هبدا اضيف العنصر الي بعد كدة
    if(n == NULL){
        free(list);
        return 1;
    }

    n->number = 2;
    n->next = NULL;
    list->next = n; // خليت النيكست بتاعت الليست تشاور علي العنصر الجديد الي عملته

    n = malloc(sizeof(node)); // هبدا اضيف العنصر الي بعد كدة
    if(n == NULL){
        free(list->next); // عملت فري للنيكست بتاعت الليست الاول علشان لو كنت عملت فري لليست علطول هفقد اللوصول للعنصر التالي
        free(list);
    }


    n->number = 3;
    n->next = NULL;
    list->next->next = n; // خليت النيكست بتاع العنصر التاني في الليست يشاور علي العنصر الجديد الي انا عملته


    // طب لو عاوز اضيق عنصل كمان في اللينكد ليست دي ومكانه يكون في الاول خالص هعمل ايي ؟

    n = malloc(sizeof(node));
    if(n != NULL){ //  NULL لا تساوي  n المرادي عملت الشرط العكس لو ال
        n->number = 0; // ضيفلي الداتا
        n->next = list; // list بيساوي ال  n خليلي النيكست بتاع ال
        list = n;       // n بتساوي ال  list خليلي ال

    }

      // طب مثلا لو عاوز اضيف العنصر ده قبل الرقم تلاتة هعمل اي يعني يكون العنصر قبل الاخير

    /*
          هعمل كدة
         if(n != NULL){
            n->number = 0;
            n->next = list->next->next;
            list->next->next = n;
         }
*/



    for(node* tmp = list ; tmp != NULL ; tmp = tmp->next ){
        printf("%d\n",tmp->number);
    }

    /* شرح الفولر لوب
    1- علشان مبوظش الليست l بتاعتي list وخليته بيساوي ال node عملت بوينتر من نوع
    2- خليت اللوب شغالة طول ما التيمب الي انا عملته لا يساوي نال
    3- وفي كل لفة خليت التمب بتساوي النيكست بتاعتها
    */



    while(list != NULL){
        node* tmp = list->next;
        free(list);
        list = tmp;
    }

/*
         شرح الوايل لوب

         1-null خليت اللوب شغالة طول ما الليست لا تساوي
         2- عملت بوينتر من نوع نود وخليته بيساوي الليست نيكست علشان اقدر اعمل فري لليست من غير ما افقد البيانات الي بعدي كدة
         3- عملت فري لليست
         4- خليت الليست تساوي التمب
         وتفدر اللوب شغالة لحد ما تعمل فري لكل العناصر

*/




}
